Change to use mermaid code
